# NoBarSizeError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..NoBarSizeError Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
This is used to post error. At least Bar Size 1 or Bar Size 2 should have another value than "None".
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoBarSizeError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoBarSizeError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoBarSizeError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace